renesas/amazon-freertos/demos/renesas/rx65n-rsk-uart-esp32/e2studio/ccrx/boot_loader/src/smc_gen/r_usb_basic/src/hw/r_usb_hreg_access.c
/***********************************************************************************************************************
 * DISCLAIMER
 * This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
 * other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
 * applicable laws, including copyright laws.
 * THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
 * THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
 * EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
 * SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS
 * SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
 * this software. By using this software, you agree to the additional terms and conditions found by accessing the
 * following link:
 * http://www.renesas.com/disclaimer
 *
 * Copyright (C) 2015(2018) Renesas Electronics Corporation. All rights reserved.
 ***********************************************************************************************************************/
/***********************************************************************************************************************
 * File Name    : r_usb_hreg_access.c
 * Description  : USB IP Host control register access code
 ***********************************************************************************************************************/
/**********************************************************************************************************************
 * History : DD.MM.YYYY Version Description
 *         : 08.01.2014 1.00 First Release
 *         : 26.12.2014 1.10 RX71M is added
 *         : 30.09.2015 1.11 RX63N/RX631 is added.
 *         : 30.09.2016 1.20 RX65N/RX651 is added.
 *         : 30.09.2017 1.22 RX62N/RX630/RX63T-H is added. and Add "__evenaccess" for I/O reg access local variable.
 *         : 31.03.2018 1.23 Supporting Smart Configurator
 *         : 16.11.2018 1.24 Added '~' before USB_OVRCRE in hw_usb_hclear_enb_ovrcre()
 ***********************************************************************************************************************/

/******************************************************************************
 Includes   <System Includes> , "Project Includes"
 ******************************************************************************/

#include "r_usb_basic_if.h"
#include "r_usb_typedef.h"
#include "r_usb_bitdefine.h"
#include "r_usb_reg_access.h"
#include "r_usb_extern.h"

#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)

/******************************************************************************
 Function Name   : hw_usb_hset_rwupe
 Description     : Set the RWUPE-bit specified port's DVSTCTR0 reg-
                 : ister. When host. To allow detection of remote wake-up from 
                 : a USB Function.
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure
 Return value    : none
 ******************************************************************************/
void hw_usb_hset_rwupe (usb_utr_t *ptr)
{
    ptr->ipp->DVSTCTR0.WORD |= USB_RWUPE;
}
/******************************************************************************
 End of function hw_usb_hset_rwupe
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_hclear_rwupe
 Description     : Clear the RWUPE-bit specified port's DVSTCTR0 reg-
                 : ister. When host. To prohibit detection of remote wake-up from 
                 : a USB Function.
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure
 Return value    : none
 ******************************************************************************/
void hw_usb_hclear_rwupe (usb_utr_t *ptr)
{
    ptr->ipp->DVSTCTR0.WORD &= (~USB_RWUPE);
}
/******************************************************************************
 End of function hw_usb_hclear_rwupe
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_hset_resume
 Description     : Set the RESUME-bit specified port's DVSTCTR0 register 
                 : When host. To allow output of resume signal to a USB Function.
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure
 Return value    : none
 ******************************************************************************/
void hw_usb_hset_resume (usb_utr_t *ptr)
{
    ptr->ipp->DVSTCTR0.WORD |= USB_RESUME;
}
/******************************************************************************
 End of function hw_usb_hset_resume
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_hclear_resume
 Description     : Clear the RESUME-bit specified port's DVSTCTR0 register 
                 : When host. To prohibit output of resume signal to a USB Func-
                 : tion.
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure
 Return value    : none
 ******************************************************************************/
void hw_usb_hclear_resume (usb_utr_t *ptr)
{
    ptr->ipp->DVSTCTR0.WORD &= (~USB_RESUME);
}
/******************************************************************************
 End of function hw_usb_hset_uact
 ******************************************************************************/
 
